Revit 2027 API
VertexBuffer Methods
The VertexBuffer type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetMappedHandle |  Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetVertexStreamPosition |  Gets a stream that can be used to write vertices of type VertexPosition into the buffer.
GetVertexStreamPositionColored |  Gets a stream that can be used to write vertices of type VertexPositionColored into the buffer.
GetVertexStreamPositionNormal |  Gets a stream that can be used to write vertices of type VertexPositionNormal into the buffer.
GetVertexStreamPositionNormalColored |  Gets a stream that can be used to write vertices of type VertexPositionNormalColored into the buffer.
IsValid |  Tests whether the buffer is valid for rendering.
Map |  Maps a portion of the buffer into memory, so that vertex data can be written into it. (see VertexStream).
ToString | Returns a string that represents the current object.
(Inherited from Object)
Unmap |  Unmaps the buffer, so that it can be used for rendering.
Top
See Also
Reference
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace